https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html

In [10]:
import pandas as pd
import numpy as np

In [11]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                    "gender": [np.nan, np.nan, np.nan],
                    "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                    "born": [pd.NaT, pd.Timestamp("1940-04-25"),pd.NaT],
                  })

In [12]:
df

       name  gender        toy       born
0    Alfred     NaN        NaN        NaT
1    Batman     NaN  Batmobile 1940-04-25
2  Catwoman     NaN   Bullwhip        NaT

In [13]:
df2 = df.dropna(axis='columns', how='all')

In [14]:
df2

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [15]:
df

       name  gender        toy       born
0    Alfred     NaN        NaN        NaT
1    Batman     NaN  Batmobile 1940-04-25
2  Catwoman     NaN   Bullwhip        NaT

In [16]:
df.dropna(axis='columns', how='all', inplace=True)

In [17]:
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT